# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/aliases'
tap "homebrew/core"
tap 'nicoverbruggen/homebrew-cask'

# Install Binaries
brew 'bat'                      # Output highlighting (better cat)
brew 'coreutils'                # Core Mac utils
brew 'httpie'                   # HTTP / API testing testing client
brew 'mackup'                   # Keep your application settings in sync
brew 'mas'                      # Command line interface for the Mac App Store
brew 'pkg-config'               # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'                    # Record and restore removed files
brew 'tree'                     # Directory listings as tree structure
brew 'wget'                     # Download tool
brew 'ripgrep'                  # Searching within files (better grep)
brew 'tmux'                     # Terminal multiplexer
brew 'neofetch'                 # Show system data and ditstro info
brew 'lsd'                      # Listing files with info (better ls)
brew 'openssl'                  # Cryptography and SSL/TLS Toolkit
brew 'fzf'                      # Fuzzy file finder and filtering
brew 'shellcheck'               # Shell script linter
brew 'tldr'                     # Community-maintained docs (better man)
brew 'entr'                     # Run arbitrary commands when files change
brew 'jq'                       # JSON parser, output and query files
brew 'imagemagick'              # Editor and image manipulator
brew 'ngrok'                    # Reverse proxy for sharing localhost
brew 'pwgen'                    # Password generator
brew 'watchman'                 # Watch for changes and reload dev server
brew 'cmake'                    # Software build tool
brew 'starship'                 # Customizable  Terminal prompt 
brew 'fd'                       # Find alternative
brew 'hyperfine'                # Benchmarking tool
brew 'navi'                     # Execute one-liners from cheatsheet
brew 'nginx'                    # HTTP server, Reverse proxy 
brew 'jdupes'                   # Duplicate file finder
brew 'sd'                       # RegEx find and replace (better sed)
brew 'tokei'                    # Count lines of code (better cloc)
brew 'rsync'                    # Fast incremental file transfer
brew 'aspell'                   # Spell check
brew 'gnupg'                    # GnuPG allows you to encrypt and sign your data and communications
brew 'rm-improved'              # Improved rm command
brew 'osv-scanner'              # Scan for packages vulnerabilities
brew 'duf'                      # Disk usage
brew 'zoxide'                   # Smart cd command

# Git
brew 'git'                      # Git Code versioning
brew 'git-lfs'                  # Git large files storage
brew 'gh'                       # Interact with GitHub PRs, issues, repos
brew 'git-delta'                # Extra git commands for common tasks
brew 'nvie/tap/git-toolbelt'    # Suite of useful Git commands
brew 'lazygit'                  # Full Git management app

# Editors
brew 'neovim'                   # VIM Text editor
cask 'visual-studio-code'       # Visual Studio Code

# Node
brew 'node'                     # NodeJs
brew 'yarn'                     # Yarn package manager
brew 'nvm'                      # Yarn node version manager
brew 'pnpm'                     # PNPM package manager

# Python
brew 'jupyterlab'               # Python integractive development environment           
brew 'pipx'                     # Use Python library without installing it
brew 'pyenv'                    # Python env managment
brew 'ruff'                     # Python prettier

# Ruby
brew 'rbenv'                    # Ruby package manager
brew 'ruby-build'               # Ruby language

# Database
brew 'postgresql'               # Postgresql Databaae
brew 'mysql'                    # MySQL Database
brew 'redis'                    # Redis key/value storage

# DevOps
brew 'ansible'                  # DevOps automation tools
brew 'docker'                   # Docker container managment
brew 'lazydocker'               # Lazydocker manage Docker containers
brew 'ctop'                     # Container metrics and monitoring
brew 'hadolint'                 # Docker linter
brew 'kubernetes-cli'           # Kubernetes CLI
cask 'docker'                   # Docker desktop


# ZSH, OH-MY-ZSH plugins
brew 'autojump'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-you-should-use'
brew 'git-open'

# Apps
brew 'statsi'                   # System resource usage in menubar
brew 'youtube-dl'               # YouTube API integration
brew 'espanso'                  # Text expander
brew 'grishka/grishka/neardrop' # Neardrop to send files from Android to Mac

# Network and Security Testing
brew 'bettercap'                # Network, scanning and monitoring
brew 'nmap'                     # Port scanning
brew 'wrk'                      # HTTP benchmarking
brew 'mkcert'                   # Certification creation
cask 'burp-suite'               # Web security testing
cask 'owasp-zap'                # Web app security scanner
cask 'wireshark'                # Network analyzer + packet capture

# Terminal
brew 'iterm2'                   # Iterm Terminal           
cask 'warp'                     # AI based Terminal

# Browsers
cask 'google-chrome'            # Google Chrome browser
cask 'firefox'                  # Firefox browser

# Cloud storage
cask 'dropbox'                  # Dropbox cloud backup
cask 'google-drive'             # GoogleDrive cloud backup

# Design
cask 'figma'                    # Figma design app

# Messaging app
cask 'slack'                    # Slack messaging app
cask 'discord'                  # Discord messaging app

cask 'anki'                     # Anki flashcard app
cask 'insomnia'                 # API Testing tool
cask 'rectangle'                # Move, resize window
cask 'amethyst'                 # Window tiling manager
cask 'coconutbattery'           # Battely life checker
cask 'karabiner-elements'       # Keyboard customizer
cask 'kap'                      # Screen recorder
cask 'alt-tab'                  # Alt tab to switch between app windows
cask 'android-studio'           # Android Studio
cask 'raycast'                  # Spotlight alternative
cask --no-quarantine 'tomatobar'# Pomodor timer
cask 'keycastr'                 # Visualize keystrokes while you type

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-hack-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-meslo-lg-nerd-font'

# Misc
brew 'tesseract'                    # Text recognition engine
brew 'tesseract-lang'               # Tesseract languages

# Create NVM directory
mkdir ~/.nvm

# Install FZF autocomplete
$(brew --prefix)/opt/fzf/install
