# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/aliases'
tap "homebrew/core"
tap 'nicoverbruggen/homebrew-cask'
tap 'nvie/tap' # git toolbelt

# Install Binaries
brew 'bat'
brew 'coreutils'
brew 'git'
brew 'git-lfs' # Git large files storage
brew 'gh'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'wget'
brew 'neovim'
brew 'ripgrep'
brew 'tmux'
brew 'neofetch'
brew 'exa'
brew 'openssl'
brew 'fzf'
brew 'git-delta'
brew 'shellcheck'
brew 'tldr'
brew 'entr' # Run arbitrary commands when files change
brew 'jq'
brew 'imagemagick'
brew 'ngrok'
brew 'pwgen'
brew 'ugit'
brew 'nvie/tap/git-toolbelt'
brew 'watchman'
brew 'cmake'
brew 'starship'
breew 'lazydocker'

# Development
brew 'postgresql'
brew 'mysql'
brew 'nginx'
brew 'redis'

# Node
brew 'node'
brew 'yarn'
brew 'nvm'
brew 'pnpm'

# Python
brew 'jupyterlab'
brew 'pipx'
brew 'pyenv'

# Ruby
brew 'rbenv'
brew 'ruby-build'

# DevOps
brew 'ansible'

# ZSH, OH-MY-ZSH plugins
brew 'autojump'
brew 'zsh-completions'


# Apps
brew 'stats'
brew 'youtube-dl'
brew 'iterm2'
brew 'espanso' # text expander

cask 'google-chrome'
cask 'docker'
cask 'firefox'
cask 'insomnia'
cask 'rectangle'
cask 'dropbox'
cask 'google-drive'
# Checks battery health
cask 'coconutbattery'
cask 'warp'
cask 'visual-studio-code'
cask 'slack'
cask 'discord'
cask 'figma'
cask 'karabiner-elements'
cask 'kap' # Screen recorder
cask 'alt-tab'
cask 'android-studio'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-hack-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-meslo-lg-nerd-font'

# Misc
brew 'tesseract' # Text recognition engine
brew 'tesseract-lang'

# Create NVM directory
mkdir ~/.nvm

# Install FZF autocomplete
$(brew --prefix)/opt/fzf/install
