# Taps
tap 'homebrew/cask'
tap 'homebrew/core'

# Install Binaries
brew 'bat'                      # Output highlighting (better cat)
brew 'coreutils'                # Core Mac utils
brew 'httpie'                   # HTTP / API testing testing client
brew 'mackup'                   # Keep your application settings in sync
brew 'mas'                      # Command line interface for the Mac App Store
brew 'pkg-config'               # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'                    # Record and restore removed files
brew 'tree'                     # Directory listings as tree structure
brew 'wget'                     # Download tool
brew 'procs'                    # Modern replacement for ps
brew 'gnu-sed'                  # GNU version of sed
brew 'gawk'                     # GNU verison of awk
brew 'ripgrep'                  # Searching within files (better grep)
brew 'tmux'                     # Terminal multiplexer
brew 'lsd'                      # Listing files with info (better ls)
brew 'openssl@3'                # Cryptography and SSL/TLS Toolkit
brew 'fzf'                      # Fuzzy file finder and filtering
brew 'shellcheck'               # Shell script linter
brew 'tldr'                     # Community-maintained docs (better man)
brew 'entr'                     # Run arbitrary commands when files change
brew 'jq'                       # JSON parser, output and query files
brew 'imagemagick'              # Editor and image manipulator
brew 'ngrok'                    # Reverse proxy for sharing localhost
brew 'pwgen'                    # Password generator
brew 'watchman'                 # Watch for changes and reload dev server
brew 'cmake'                    # Software build tool
brew 'just'                     # Command runner, Makefile replacement
brew 'starship'                 # Customizable  Terminal prompt 
brew 'fd'                       # Find alternative
brew 'hyperfine'                # Benchmarking tool
brew 'navi'                     # Execute one-liners from cheatsheet
brew 'jdupes'                   # Duplicate file finder
brew 'sd'                       # RegEx find and replace (better sed)
brew 'tokei'                    # Count lines of code (better cloc)
brew 'rsync'                    # Fast incremental file transfer
brew 'pstree'                   # Display process tree
brew 'aspell'                   # Spell check
brew 'gnupg'                    # GnuPG allows you to encrypt and sign your data and communications
brew 'rm-improved'              # Improved rm command
brew 'rip2'                     # Rust based rm alternative
brew 'osv-scanner'              # Scan packages for vulnerabilities
brew 'duf'                      # Disk usage
brew 'zoxide'                   # Smart cd command
brew 'htop'                     # top alternative to see running processes  
brew 'btop'                     # System monitoring
brew 'glances'                  # Monitoring tool
brew 'vivid'                    # Theme for LS_COLORS
brew 'myrepos'                  # Run commands in multiple Git repositories
brew 'watch'                    # Executes a program periodically
brew 'jsonnet'                  # Data templating language
brew 'terminal-notifier'        # Terminal notifier
brew 'oha'                      # Load generator
brew 'ast-grep'                 # Code searching tool
brew 'glow'                     # Markdown reader in terminal
brew 'yazi'                     # Terminal file manager
brew 'fastfetch'                # System info in terminal
brew 'ffmpeg'                   # Video and audio processing


# Git
brew 'git'                      # Git Code versioning
brew 'git-lfs'                  # Git large files storage
brew 'gh'                       # Interact with GitHub PRs, issues, repos
brew 'git-delta'                # Extra git commands for common tasks
brew 'nvie/tap/git-toolbelt'    # Suite of useful Git commands
brew 'lazygit'                  # Full Git management app
brew 'tig'                      # Text interface for Git repositories

# Editors
brew 'neovim'                   # VIM Text editor

# Node
brew 'node'                     # NodeJs
tap 'oven-sh/bun'               # Tap for Bun JS runtime
brew 'bun'                      # Bun JS runtime
brew 'nvm'                      # Node version manager
brew 'fnm'                      # Node version manager built with Rust
brew 'pnpm'                     # PNPM package manager
brew 'dotenvx/brew/dotenvx'     # Encrypt env files

# Go
brew 'go' # Go language

# Rust
brew 'rustup' # Rust language

# Python
brew 'jupyterlab'               # Python integractive development environment           
brew 'ruff'                     # Python prettier
brew 'bpython'                  # Better Python shell
brew 'python-setuptools'        # Package distribution tool
brew 'uv'                       # Fast package manager
brew 'pre-commit'               # Pre-commit hooks

# Ruby
brew 'rbenv'                    # Ruby package manager
brew 'ruby-build'               # Ruby language

# Database CLI
brew 'pg_top'                   # top but for Postgresql
brew 'pgcli'                    # Postgresql CLI

# DevOps
brew 'ansible'                  # DevOps automation tools
brew 'docker'                   # Docker container management
brew 'lazydocker'               # Lazydocker manage Docker containers
brew 'ctop'                     # Container metrics and monitoring
brew 'hadolint'                 # Docker linter
brew 'kubernetes-cli'           # Kubernetes CLI
brew 'derailed/k9s/k9s'         # Kubernetes CLI management
brew 'kubecolor'
brew 'minikube'                 # Minikube
brew 'helm'                     # Helm Kubernetes package manager
brew 'helmfile'                 # Manage and deploy Helm charts
brew 'kompose'                  # Convert docker-compose to Kubernetes files
brew 'tnk-studio/tools/lazykube' # Lazy kubernetes management
brew 'dive'                      # Explore each Docker layer
brew 'orbstack'                 # Docker desktop alternative
brew 'act'                      # Run GitHub Actions locally

# Terraform
tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'
terraform -install-autocomplete

# cask "google-cloud-sdk"         # Google Cloud SDK CLI

# Swift
brew 'swiftlint'                # Swift linter
brew 'swiftformat'              # Swift code formatter
brew 'xcbeautify'               # Prettify for buidl and test commands
brew 'cameroncooke/axe/axe'      # CLI tool for interacting with iOS Simulators

# Android
brew 'android-platform-tools'       # Android platform tools (adb, fastboot)
brew 'gradle'                       # Build tool for Android projects
brew 'kotlin'                       # Kotlin programming language
brew 'kdoctor'                      # Kotlin doctor for diagnosing setup issues


# ZSH, OH-MY-ZSH plugins
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-you-should-use'

# AI
cask 'codex'
brew 'gemini-cli'
brew 'anomalyco/tap/opencode'
brew 'ollama'

# Apps
brew 'statsi'                   # System resource usage in menubar
brew 'yt-dlp'                   # YouTube API integration
brew 'tw93/tap/mole'            # Deep clean and optimize Mac

# Network and Security Testing
brew 'bettercap'                # Network, scanning and monitoring
brew 'nmap'                     # Port scanning
brew 'wrk'                      # HTTP benchmarking
brew 'mtr'                      # traceroute and ping in a single tool
brew 'mkcert'                   # Certification creation
cask 'burp-suite'               # Web security testing
cask 'owasp-zap'                # Web app security scanner

# Terminal
brew 'iterm2'                   # Iterm Terminal

# Create NVM directory
mkdir ~/.nvm

# Install FZF autocomplete
$(brew --prefix)/opt/fzf/install
