alefragnani.project-manager
almenon.arepl
anseki.vscode-color
bierner.lit-html
christian-kohler.path-intellisense
CoenraadS.bracket-pair-colorizer
dbaeumer.vscode-eslint
donjayamanne.python-extension-pack
DSKWRK.vscode-generate-getter-setter
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
emmanuelbeziat.vscode-great-icons
esbenp.prettier-vscode
formulahendry.auto-rename-tag
formulahendry.code-runner
GrapeCity.gc-excelviewer
GraphQL.vscode-graphql
hbenl.vscode-test-explorer
yzhang.markdown-all-in-one
jpoissonnier.vscode-styled-components
kamikillerto.vscode-colorize
kenhowardpdx.vscode-gist
littlefoxteam.vscode-python-test-adapter
magicstack.MagicPython
meganrogge.template-string-converter
mikestead.dotenv
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-pyright.pyright
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode-remote.remote-wsl
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
msjsdiag.debugger-for-chrome
mtxr.sqltools
naumovs.color-highlight
Orta.vscode-jest
PKief.material-icon-theme
pmneo.tsimporter
pranaygp.vscode-css-peek
rangav.vscode-thunder-client
redhat.vscode-yaml
ritwickdey.live-sass
ritwickdey.LiveServer
Shan.code-settings-sync
silvenon.mdx
SimonSiefke.svg-preview
stringham.move-ts
techer.open-in-browser
theumletteam.umlet
usernamehw.errorlens
vincaslt.highlight-matching-tag
VisualStudioExptTeam.vscodeintellicode
WakaTime.vscode-wakatime
WallabyJs.quokka-vscode
wix.vscode-import-cost
xyc.vscode-mdx-preview
Zignd.html-css-class-completion