alefragnani.Bookmarks
alefragnani.project-manager
anseki.vscode-color
be5invis.vscode-custom-css
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
eamodio.gitlens
felixfbecker.php-debug
felixfbecker.php-intellisense
formulahendry.code-runner
goessner.mdmath
GrapeCity.gc-excelviewer
justusadam.language-haskell
liximomo.sftp
ms-python.python
ms-vscode.cpptools
mtxr.sqltools
neilbrayfield.php-docblocker
onecentlin.laravel-blade
pranaygp.vscode-css-peek
redhat.java
ritwickdey.LiveServer
Shan.code-settings-sync
shengchen.vscode-leetcode
shinnn.stylelint
streetsidesoftware.code-spell-checker
techer.open-in-browser
vincaslt.highlight-matching-tag
vscjava.vscode-java-debug
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
WakaTime.vscode-wakatime
wesbos.theme-cobalt2
yzhang.markdown-all-in-one
